## Staging: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 6 to add, 0 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                            NAME                            |
|--------|------------------------------------------------------------|
| add    | `aws_secretsmanager_secret.pr_bot_app_id`                  |
|        | `aws_secretsmanager_secret.pr_bot_installation_id`         |
|        | `aws_secretsmanager_secret.pr_bot_private_key`             |
|        | `aws_secretsmanager_secret_version.pr_bot_app_id`          |
|        | `aws_secretsmanager_secret_version.pr_bot_installation_id` |
|        | `aws_secretsmanager_secret_version.pr_bot_private_key`     |
| delete | `aws_secretsmanager_secret.gha_arc_pat`                    |
|        | `aws_secretsmanager_secret_version.gha_arc_pat`            |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_secretsmanager_secret.gha_arc_pat will be destroyed
  # (because aws_secretsmanager_secret.gha_arc_pat is not in configuration)
  - resource "aws_secretsmanager_secret" "gha_arc_pat" {
      - arn                            = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:GITHUB_ARC_PAT-iWxUqa" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:GITHUB_ARC_PAT-iWxUqa" -> null
      - name                           = "GITHUB_ARC_PAT" -> null
      - recovery_window_in_days        = 30 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
    }

  # aws_secretsmanager_secret.pr_bot_app_id will be created
  + resource "aws_secretsmanager_secret" "pr_bot_app_id" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "PR_BOT_APP_ID"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags_all                       = (known after apply)
    }

  # aws_secretsmanager_secret.pr_bot_installation_id will be created
  + resource "aws_secretsmanager_secret" "pr_bot_installation_id" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "PR_BOT_INSTALLATION_ID"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags_all                       = (known after apply)
    }

  # aws_secretsmanager_secret.pr_bot_private_key will be created
  + resource "aws_secretsmanager_secret" "pr_bot_private_key" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "PR_BOT_PRIVATE_KEY"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags_all                       = (known after apply)
    }

  # aws_secretsmanager_secret_version.gha_arc_pat will be destroyed
  # (because aws_secretsmanager_secret_version.gha_arc_pat is not in configuration)
  - resource "aws_secretsmanager_secret_version" "gha_arc_pat" {
      - arn            = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:GITHUB_ARC_PAT-iWxUqa" -> null
      - id             = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:GITHUB_ARC_PAT-iWxUqa|terraform-20240313190359311200000001" -> null
      - secret_id      = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:GITHUB_ARC_PAT-iWxUqa" -> null
      - secret_string  = (sensitive value) -> null
      - version_id     = "terraform-20240313190359311200000001" -> null
      - version_stages = [
          - "AWSCURRENT",
        ] -> null
    }

  # aws_secretsmanager_secret_version.pr_bot_app_id will be created
  + resource "aws_secretsmanager_secret_version" "pr_bot_app_id" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.pr_bot_installation_id will be created
  + resource "aws_secretsmanager_secret_version" "pr_bot_installation_id" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.pr_bot_private_key will be created
  + resource "aws_secretsmanager_secret_version" "pr_bot_private_key" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

Plan: 6 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.internal_alb_tls"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.internal_nginx_http"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-prometheus-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-evicted-pods[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-memory-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-replicas-unavailable[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.aggregating-queues-not-active-1-minute-warning[0]"]
WARN -...
```

</details>
